yazidta/Flying-Probe-Tester/STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "lcd_config.h"
#include "encoder.h"
#include "encoder_config.h"
#include "stm32f7xx_hal.h"
#include "TMC2209.h"
#include "TMC2209_configs.h"
#include "servo.h"
#include "fatfs.h"
#include "calibration.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */



/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim7;
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim14;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart5;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart5_rx;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart6_rx;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */


SERVO_Handle_TypeDef hservo1 = { .PwmOut = PWM_INIT_HANDLE(&htim14, TIM_CHANNEL_1) };
SERVO_Handle_TypeDef hservo2 = { .PwmOut = PWM_INIT_HANDLE(&htim9, TIM_CHANNEL_1) };

Motor motors[MAX_MOTORS]; // Global motor array
Axis axes[MAX_MOTORS_PER_AXIS]; // Global axes array

volatile uint8_t flagUserBtn = 0;

// ENDTOP FLAGS:
volatile uint8_t ES1 = 0;
volatile uint8_t ES2 = 0;
volatile uint8_t ES3 = 0;
volatile uint8_t ES4 =0;

volatile uint8_t Btn1 = 0;
volatile uint8_t Btn2 = 0;
volatile uint8_t Btn3 = 0;
volatile uint8_t Btn4 =0;
volatile uint8_t Btn5 =0;

// Homing Flags

volatile uint8_t homingFlag = 0;



/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
static void MX_TIM7_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM2_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM14_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM9_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_UART4_Init(void);
static void MX_UART5_Init(void);
static void MX_TIM1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == USER_Btn_Pin) // Check if the interrupt is for the correct button
    {

    flagUserBtn = 1;
    }

}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  MX_TIM7_Init();
  MX_TIM4_Init();
  MX_TIM2_Init();
  MX_USART2_UART_Init();
  MX_FATFS_Init();
  MX_SPI2_Init();
  MX_TIM3_Init();
  MX_TIM14_Init();
  MX_TIM5_Init();
  MX_TIM9_Init();
  MX_I2C1_Init();
  MX_USART6_UART_Init();
  MX_UART4_Init();
  MX_UART5_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */

  LCD_I2C_Init(&hlcd3);
  LCD_I2C_Clear(&hlcd3);
  LCD_I2C_DisplaySequentialGlossyText(&hlcd3,2);

  SERVO_Init(&hservo1);
  SERVO_Init(&hservo2);

  initializeMotors();
  initializeSystem();
  ENC_Init(&henc1);

  TMC2209_setMotorsConfiguration(motors,8,1);
  TMC2209_MoveTo(&axes[1],1,30);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
   while (1){

	   /// DEBUG ///
	      ES1 =IsSensorTriggered(EndStop1_GPIO_Port, EndStop1_Pin);
	      ES2 =IsSensorTriggered(EndStop2_GPIO_Port, EndStop2_Pin);
	      ES3= IsSensorTriggered(EndStop3_GPIO_Port,EndStop3_Pin);
	      ES4 = IsSensorTriggered(EndStop4_GPIO_Port,EndStop4_Pin);

	      Btn1 = IsSensorTriggered(BtnLeft_GPIO_Port, BtnLeft_Pin);
	      Btn2 = IsSensorTriggered(BtnRight_GPIO_Port, BtnRight_Pin);
	      Btn3 = IsSensorTriggered(BtnDown_GPIO_Port, BtnDown_Pin);
	      Btn4 = IsSensorTriggered(BtnUp_GPIO_Port, BtnUp_Pin);
	      Btn5 = IsSensorTriggered(BtnCtr_GPIO_Port, BtnCtr_Pin);
	   /// DEBUG ///

      if (flagUserBtn)	{
    	homingFlag = MotorsHoming(&motors);

    	flagUserBtn = 0;
      }
  	if (homingFlag){
    	  MotorControl_ButtonHandler(&axes,&motors);
      }



